app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "first_name", "last_name", "mark", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 16 Jun 2015 07:05:16 UTC +00:00], ["first_name", "Madan"], ["last_name", "M"], ["mark", 61], ["updated_at", Tue, 16 Jun 2015 07:05:16 UTC +00:00]]
---
  def create
    @student = Student.new(student_params)
    @student.save

UPDATE "students" SET "first_name" = $1, "updated_at" = $2 WHERE "students"."id" = 111  [["first_name", "aaa"], ["updated_at", Tue, 16 Jun 2015 09:45:38 UTC +00:00]]
---
  def update
    @student.update(student_params)